<a href="https://colab.research.google.com/github/tartam1/IT545/blob/main/Lab_6_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lab Assignment 6

## Chapter 11 Time Series

In [1]:
# Import Series and DataFrame into local namespace
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
# Import Matplotlib
import matplotlib.pyplot as plt
# Import datetime
from datetime import datetime

## Problem 1

#### In this problem, you  will type out the input lines In [14] thorugh In [25] in 11.2. Date and Time Dat Types and Tools (stop before Converting Between String and Datetime) of the textbook.

In [2]:
# Insert commenting and code in this cell.
# work with date time
from datetime import datetime
now = datetime.now()
now

datetime.datetime(2025, 8, 18, 20, 21, 54, 228529)

In [5]:
# access specific values
now.year, now.month, now.day

# get difference
delta = datetime(2011, 1, 7) - datetime(2008, 6, 24, 8, 15)
delta

datetime.timedelta(days=926, seconds=56700)

In [6]:

# Get days diff
delta.days

926

In [7]:
# get secends diff
delta.seconds

56700

In [9]:
# shifting the object
from datetime import timedelta
start = datetime(2011, 1, 7)
start + timedelta(12)

datetime.datetime(2011, 1, 19, 0, 0)

In [10]:
start - 2 * timedelta(12)

datetime.datetime(2010, 12, 14, 0, 0)

## Problem 2

#### In this problem, you wil convert between a string and datetime. Complete In [26] - In [28] under heading Converting Between String and Datetime (stop before Table 11-2) of the textbook.

In [11]:
# Insert commenting and code in this cell.
# Converting Between String and Datetime
stamp = datetime(2011, 1, 3)
str(stamp)

'2011-01-03 00:00:00'

In [12]:
# format it
stamp.strftime("%Y-%m-%d")

'2011-01-03'

## Problem 3

#### In this problem, you complete In [39] - In [46] after 11.2 Time Series Basics (heading) stopping before the Indexing, Selection, Subsetting (heading) of the textbook.

In [14]:
# Insert commenting and code in this cell.
# Time Series Basics
dates = [datetime(2011, 1, 2), datetime(2011, 1, 5),
         datetime(2011, 1, 7), datetime(2011, 1, 8),
         datetime(2011, 1, 10), datetime(2011, 1, 12)]
ts = pd.Series(np.random.standard_normal(6), index=dates)
ts

2011-01-02   -0.105260
2011-01-05    0.481638
2011-01-07   -0.096856
2011-01-08    0.862405
2011-01-10    0.529919
2011-01-12   -0.514949
dtype: float64

In [15]:
# Under the hood
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [16]:
# align info every second item
ts + ts[::2]

2011-01-02   -0.210520
2011-01-05         NaN
2011-01-07   -0.193713
2011-01-08         NaN
2011-01-10    1.059838
2011-01-12         NaN
dtype: float64

In [17]:
ts.index.dtype

dtype('<M8[ns]')

In [18]:
# check object type
stamp = ts.index[0]
stamp

Timestamp('2011-01-02 00:00:00')

## Problem 4

#### In this problem, you will work with time series with duplicate values. Complete the In [62] - In [70] after Time Series with Duplicate Indices (heading) and stopping before 11.3 Date Ranges, Frequencies, and Shifting (heading) of the textbook.

In [19]:
# Insert commenting and code in this cell.
# Time Series with Duplicate Indices
dates = pd.DatetimeIndex(['1/1/2000', '1/2/2000', '1/2/2000',
                          '1/2/2000', '1/3/2000'])
dup_ts = pd.Series(np.arange(5), index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int64

In [20]:
# is unique
dup_ts.index.is_unique

False

In [21]:
# dups ?
dup_ts["2000-01-03"]

np.int64(4)

In [22]:
# dups?
dup_ts["2000-01-02"]

2000-01-02    1
2000-01-02    2
2000-01-02    3
dtype: int64

In [23]:
# groupby
grouped = dup_ts.groupby(level=0)
grouped.mean()

2000-01-01    0.0
2000-01-02    2.0
2000-01-03    4.0
dtype: float64

In [24]:
grouped.count()

2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

## Problem 5

#### In this problem, you will work on generating date ranges. Complete In [74] - In [80] after Generating Date Ranges (heading) and stopping before Frequencies and Date Offsets (heading) of the textbook.

In [25]:
# Insert commenting and code in this cell.
# Generating Date Ranges
index = pd.date_range("4/1/2012", "6/1/2012")
index

DatetimeIndex(['2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
               '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
               '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
               '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
               '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20',
               '2012-04-21', '2012-04-22', '2012-04-23', '2012-04-24',
               '2012-04-25', '2012-04-26', '2012-04-27', '2012-04-28',
               '2012-04-29', '2012-04-30', '2012-05-01', '2012-05-02',
               '2012-05-03', '2012-05-04', '2012-05-05', '2012-05-06',
               '2012-05-07', '2012-05-08', '2012-05-09', '2012-05-10',
               '2012-05-11', '2012-05-12', '2012-05-13', '2012-05-14',
               '2012-05-15', '2012-05-16', '2012-05-17', '2012-05-18',
               '2012-05-19', '2012-05-20', '2012-05-21', '2012-05-22',
               '2012-05-23', '2012-05-24', '2012-05-25', '2012-05-26',
               '2012-05-27', '2012-05-28', '2012-05-29', '2012-05-30',
               '2012-05-31', '2012-06-01'],
              dtype='datetime64[ns]', freq='D')

In [26]:
pd.date_range(start="2012-04-01", periods=20)

DatetimeIndex(['2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
               '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
               '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
               '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
               '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20'],
              dtype='datetime64[ns]', freq='D')

In [27]:
pd.date_range(end="2012-06-01", periods=20)

DatetimeIndex(['2012-05-13', '2012-05-14', '2012-05-15', '2012-05-16',
               '2012-05-17', '2012-05-18', '2012-05-19', '2012-05-20',
               '2012-05-21', '2012-05-22', '2012-05-23', '2012-05-24',
               '2012-05-25', '2012-05-26', '2012-05-27', '2012-05-28',
               '2012-05-29', '2012-05-30', '2012-05-31', '2012-06-01'],
              dtype='datetime64[ns]', freq='D')

In [28]:
pd.date_range("2000-01-01", "2000-12-01", freq="BM")

/tmp/ipython-input-3742551278.py:1: FutureWarning: 'BM' is deprecated and will be removed in a future version, please use 'BME' instead.
  pd.date_range("2000-01-01", "2000-12-01", freq="BM")

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-28',
               '2000-05-31', '2000-06-30', '2000-07-31', '2000-08-31',
               '2000-09-29', '2000-10-31', '2000-11-30'],
              dtype='datetime64[ns]', freq='BME')

In [29]:
pd.date_range("2012-05-02 12:56:31", periods=5)

DatetimeIndex(['2012-05-02 12:56:31', '2012-05-03 12:56:31',
               '2012-05-04 12:56:31', '2012-05-05 12:56:31',
               '2012-05-06 12:56:31'],
              dtype='datetime64[ns]', freq='D')

In [30]:
# normalized
pd.date_range("2012-05-02 12:56:31", periods=5, normalize=True)

DatetimeIndex(['2012-05-02', '2012-05-03', '2012-05-04', '2012-05-05',
               '2012-05-06'],
              dtype='datetime64[ns]', freq='D')

## Problem 6

#### In this problem, you will demonstrate the usage of frequencies and date offsets. Complete In [81] - In [90] starting after Frequencies and Date Offsets (heading) and stoping before Shifting (Leading and Lagging) Date (heading) of the textbook.

In [31]:
# Insert commenting and code in this cell.
# Frequencies and Date Offsets
from pandas.tseries.offsets import Hour, Minute
hour = Hour()
hour

In [32]:
four_hours = Hour(4)
four_hours

In [33]:
# range pass freq
pd.date_range("2000-01-01", "2000-01-03 23:59", freq="4H")

/tmp/ipython-input-2714302941.py:2: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  pd.date_range("2000-01-01", "2000-01-03 23:59", freq="4H")

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4h')

In [35]:
# combine offsets
Hour(2) + Minute(30)

In [36]:
pd.date_range("2000-01-01", periods=10, freq="1h30min")

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:30:00',
               '2000-01-01 03:00:00', '2000-01-01 04:30:00',
               '2000-01-01 06:00:00', '2000-01-01 07:30:00',
               '2000-01-01 09:00:00', '2000-01-01 10:30:00',
               '2000-01-01 12:00:00', '2000-01-01 13:30:00'],
              dtype='datetime64[ns]', freq='90min')

In [39]:
# week of month dates
monthly_dates = pd.date_range("2012-01-01", "2012-09-01", freq="WOM-3FRI")
list(monthly_dates)

[Timestamp('2012-01-20 00:00:00'),
 Timestamp('2012-02-17 00:00:00'),
 Timestamp('2012-03-16 00:00:00'),
 Timestamp('2012-04-20 00:00:00'),
 Timestamp('2012-05-18 00:00:00'),
 Timestamp('2012-06-15 00:00:00'),
 Timestamp('2012-07-20 00:00:00'),
 Timestamp('2012-08-17 00:00:00')]

## Problem 7

#### In this problem, you will demonstrate a basic time zone handling problem. Complete In [110] - In [117] starting after 11.4 Time Zone Handling (heading) and stopping before text / paragraph of "Date ranges can be generated with a time zone set" of the textbook.

In [40]:
# Insert commenting and code in this cell.
# Time Zone Handling get timezones
import pytz
pytz.common_timezones[-5:]

['US/Eastern', 'US/Hawaii', 'US/Mountain', 'US/Pacific', 'UTC']

In [41]:
tz = pytz.timezone("America/New_York")
tz

In [42]:
# Time Zone Localization and Conversion
dates = pd.date_range("2012-03-09 09:30", periods=6)
ts = pd.Series(np.random.standard_normal(len(dates)), index=dates)
ts

2012-03-09 09:30:00    0.864316
2012-03-10 09:30:00   -0.573113
2012-03-11 09:30:00    0.115655
2012-03-12 09:30:00   -3.030066
2012-03-13 09:30:00    0.265401
2012-03-14 09:30:00    1.258323
Freq: D, dtype: float64

In [43]:
print(ts.index.tz)

None

## Problem 8

#### In this problem, you will demonstrate operations between different time zones. Complete In [141] - In [147] starting after Operatins Between Different Time Zones (heading) and stopping before 11.5 Periods and Period Arithmetic (heading) of the textbook.

In [44]:
# Insert commenting and code in this cell.
# Operations Between Different Time Zones
dates = pd.date_range("2012-03-07 09:30", periods=10, freq="B")
ts = pd.Series(np.random.standard_normal(len(dates)), index=dates)
ts

2012-03-07 09:30:00   -0.409859
2012-03-08 09:30:00   -0.033085
2012-03-09 09:30:00    0.069200
2012-03-12 09:30:00    1.083736
2012-03-13 09:30:00    0.054952
2012-03-14 09:30:00    0.459853
2012-03-15 09:30:00   -1.038175
2012-03-16 09:30:00    0.447275
2012-03-19 09:30:00   -0.170063
2012-03-20 09:30:00    0.114444
Freq: B, dtype: float64

In [46]:
ts1 = ts[:7].tz_localize("Europe/London")
ts2 = ts1[2:].tz_convert("Europe/Moscow")
result = ts1 + ts2
result.index

DatetimeIndex(['2012-03-07 09:30:00+00:00', '2012-03-08 09:30:00+00:00',
               '2012-03-09 09:30:00+00:00', '2012-03-12 09:30:00+00:00',
               '2012-03-13 09:30:00+00:00', '2012-03-14 09:30:00+00:00',
               '2012-03-15 09:30:00+00:00'],
              dtype='datetime64[ns, UTC]', freq=None)

## Problem 9

#### In this problem, you will work with period arithmetic. Complete In [148] - In [158] starting after 11.5 Periods and Period Arithmetic (heading) and stopping before Period Frequency Conversion (heading) of the textbook.

In [47]:
# Insert commenting and code in this cell.
# Periods and Period Arithmetic
p = pd.Period("2011", freq="A-DEC")
p

/tmp/ipython-input-4059779374.py:3: FutureWarning: 'A-DEC' is deprecated and will be removed in a future version, please use 'Y-DEC' instead.
  p = pd.Period("2011", freq="A-DEC")

Period('2011', 'Y-DEC')

In [48]:
p + 5

Period('2016', 'Y-DEC')

In [49]:
p - 2

Period('2009', 'Y-DEC')

In [50]:
pd.Period("2014", freq="A-DEC") - p

/tmp/ipython-input-3816979827.py:1: FutureWarning: 'A-DEC' is deprecated and will be removed in a future version, please use 'Y-DEC' instead.
  pd.Period("2014", freq="A-DEC") - p

In [51]:
# regular ranges
periods = pd.period_range("2000-01-01", "2000-06-30", freq="M")
periods

PeriodIndex(['2000-01', '2000-02', '2000-03', '2000-04', '2000-05', '2000-06'], dtype='period[M]')

In [52]:
# period index
pd.Series(np.random.standard_normal(6), index=periods)

2000-01    0.987508
2000-02   -0.337023
2000-03    0.964956
2000-04    1.112799
2000-05   -0.479657
2000-06   -0.667948
Freq: M, dtype: float64

In [53]:
values = ["2001Q3", "2002Q2", "2003Q1"]
index = pd.PeriodIndex(values, freq="Q-DEC")
index

PeriodIndex(['2001Q3', '2002Q2', '2003Q1'], dtype='period[Q-DEC]')

## Problem 10

#### In this problem, you will be working with the pandas resample method to resample data. Complete In [208] - In [212] starting after 11.6 Resampling and Frequency Conversion (heading) and stop before Table 11-5 of the textbook.

In [54]:
# Insert commenting and code in this cell.
# Resampling and Frequency Conversion
dates = pd.date_range("2000-01-01", periods=100)
ts = pd.Series(np.random.standard_normal(len(dates)), index=dates)
ts

2000-01-01    0.458751
2000-01-02    1.971564
2000-01-03    1.288894
2000-01-04   -0.534291
2000-01-05   -0.250551
                ...
2000-04-05    0.548757
2000-04-06    0.180223
2000-04-07    1.498200
2000-04-08   -2.307133
2000-04-09    0.907313
Freq: D, Length: 100, dtype: float64

In [55]:
ts.resample("M").mean()

/tmp/ipython-input-3978117481.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  ts.resample("M").mean()

2000-01-31    0.175549
2000-02-29    0.238513
2000-03-31   -0.393099
2000-04-30    0.160057
Freq: ME, dtype: float64

In [56]:
ts.resample("M", kind="period").mean()

/tmp/ipython-input-1563622178.py:1: FutureWarning: The 'kind' keyword in Series.resample is deprecated and will be removed in a future version. Explicitly cast the index to the desired type instead
  ts.resample("M", kind="period").mean()
/tmp/ipython-input-1563622178.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  ts.resample("M", kind="period").mean()

2000-01    0.175549
2000-02    0.238513
2000-03   -0.393099
2000-04    0.160057
Freq: M, dtype: float64